In [72]:
import pandas as pd
import MySQLdb as ms

In [73]:
 db = ms.connect('localhost', 'root', '1234', charset='utf8')

In [92]:
cursor = db.cursor()

In [77]:
sql = '''
show databases;
'''
cursor.execute(sql)

10

In [78]:
cursor.fetchall()

(('information_schema',),
 ('budongsan',),
 ('casequiz',),
 ('employees',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sqldb',),
 ('sys',),
 ('world',))

In [79]:
sql = '''
drop database if exists casequiz;
create database casequiz;
'''
cursor.execute(sql)

2

In [80]:
cursor.fetchall()

()

In [81]:
db = ms.connect('localhost', 'root', '1234', 'casequiz', charset='utf8')
cursor = db.cursor()

In [10]:
sql = '''
drop table if exists emp;
create table emp(
    id char(3) primary key not null,
    position char(10) not null,
    party_nm char(10) not null,
    manager_id char(10) not null,
    team char(10),
    grade char(10)
)
'''
cursor.execute(sql)

0

In [13]:
sql = '''
insert into emp values('650', '대리', '이재훈', '127', '마케팅', '1');
insert into emp values('540', '과장', '장성수', '3221', '리스크', '2');
insert into emp values('210', '차장', '문보미', '3914', '인사팀', '3');
insert into emp values('347', '차장', '정호천', '3924', '기획팀', '3');
insert into emp values('970', '부장', '김영성', '3221', '리스크', '2');
insert into emp values('345', '대리', '오윤경', '1270', '마케팅', '2');
insert into emp values('711', '과장', '이재중', '3914', '인사팅', '2');
'''
cursor.execute(sql)

IntegrityError: (1062, "Duplicate entry '650' for key 'PRIMARY'")

In [12]:
cursor.fetchall()

()

In [24]:
sql = '''
select * from casa_201312;
'''

pd.read_sql(sql, db)

  CUST_ID CUST_SEG  BALANCE_201311  BALANCE_201312
0   12344   SILVER        210000.0        200000.0
1   12478  DIAMOND       6015000.0       5800000.0
2   23458  DIAMOND       5000000.0       6200000.0
3   32134     GOLD       2354000.0       3200000.0
4   34181     GOLD       4200000.0       4100000.0
5   54560   SILVER       1000000.0       2000000.0
6   54789   SILVER        200000.0        300000.0
7   68477     GOLD        112000.0          3500.0
8   96147   SILVER        300000.0       1000010.0

In [30]:
sql = '''
select (case when BALANCE_201312 > BALANCE_201311*1.1 then 1 else 0 end) as accept 
from casa_201312;
'''

pd.read_sql(sql, db)

   accept
0       0
1       0
2       1
3       1
4       0
5       1
6       1
7       0
8       1

In [31]:
sql = '''
select avg(case when BALANCE_201312 > BALANCE_201311*1.1 then 1 else 0 end) as accept 
from casa_201312;
'''

pd.read_sql(sql, db)

   accept
0  0.5556

In [32]:
sql = '''
select sum(BALANCE_201312 - BALANCE_201311) as accrue
from casa_201312;
'''

pd.read_sql(sql, db)

      accrue
0  3412510.0

In [103]:
db = ms.connect('localhost', 'root', '1234', 'casequiz', charset='utf8')
cursor = db.cursor()

In [104]:
cursor.execute('drop table CASA_201312;')

OperationalError: (1051, "Unknown table 'casequiz.casa_201312'")

In [107]:
sql = """
CREATE TABLE CASA_201312
(
CUST_ID CHAR(13) PRIMARY KEY NOT NULL,
CUST_SEG CHAR(10) NOT NULL,
BALANCE_201311 DECIMAL(15,0),
BALANCE_201312 DECIMAL(15,0)
);
"""

cursor.execute(sql)

0

In [108]:
sql = """
INSERT INTO CASA_201312 VALUES ('54560', 'SILVER', 1000000, 2000000);
INSERT INTO CASA_201312 VALUES ('68477', 'GOLD', 112000, 3500);
INSERT INTO CASA_201312 VALUES ('96147', 'SILVER', 300000, 1000010);
INSERT INTO CASA_201312 VALUES ('32134', 'GOLD', 2354000, 3200000);
INSERT INTO CASA_201312 VALUES ('12478', 'DIAMOND', 6015000, 5800000);
INSERT INTO CASA_201312 VALUES ('54789', 'SILVER', 200000, 300000);
INSERT INTO CASA_201312 VALUES ('34181', 'GOLD', 4200000, 4100000);
INSERT INTO CASA_201312 VALUES ('23458', 'DIAMOND', 5000000, 6200000);
INSERT INTO CASA_201312 VALUES ('12344', 'SILVER', 210000, 200000);
"""

cursor.execute(sql)

1

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': not all arguments converted during bytes formatting